tap "chipsalliance/verible"
tap "hashicorp/tap"
tap "homebrew/services"
# C/C++ multimedia library for cross-platform game development
brew "allegro"
# Shell extension to jump to frequently used directories
brew "autojump"
# New way to see and navigate directory trees
brew "broot"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Utility to bundle libraries into executables for macOS
brew "dylibbundler"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Command-line benchmarking tool
brew "hyperfine"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Remote terminal application
brew "mosh"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Parse HTML at the command-line
brew "pup"
# Software environment for statistical computing
brew "r"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to impose load on and stress test a computer system
brew "stress"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Collection of Linux utilities
brew "util-linux"
# Verilog simulator
brew "verilator"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi", args: ["HEAD"]
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# SystemVerilog developer tools
brew "chipsalliance/verible/verible"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Text editor
cask "emacs"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Development environment
cask "hashicorp-vagrant"
# Create experiments in behavioral science
cask "psychopy"
vscode "esbenp.prettier-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ritwickdey.liveserver"
vscode "twxs.cmake"
